share/man/man4/isa.4
.\"	$OpenBSD: isa.4,v 1.60 2008/03/19 19:33:12 deraadt Exp $
.\"	$NetBSD: isa.4,v 1.19 2000/03/18 16:54:37 augustss Exp $
.\"
.\" Copyright (c) 2000 Theo de Raadt.  All rights reserved.
.\" Copyright (c) 1997 Jason R. Thorpe.  All rights reserved.
.\" Copyright (c) 1997 Jonathan Stone
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgements:
.\"      This product includes software developed by Jonathan Stone
.\" 4. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 10, 2013
.Dt ISA 4
.Os
.Sh NAME
.Nm isa
.Nd introduction to ISA bus support
.Sh SYNOPSIS
.Cd "device isa"
.Sh DESCRIPTION
The system includes a machine-independent
.Tn ISA
bus subsystem and several machine-independent
.Tn ISA
device drivers.
.Pp
Note that interrupt mappings on the i386 may require that you configure
your BIOS to reserve the interrupts for these devices as "Legacy ISA".
If such configuration is not done, the system may use those interrupts
for
.Xr pci 4
devices instead.
.Pp
.Dx
provides support for the following devices.
Note that not all architectures support all devices.
.Ss Disk and tape controllers
.Bl -tag -width 12n -offset indent -compact
.It Xr fdc 4
PC architecture floppy disk controller driver
.It Xr nata 4
Generic ATA/ATAPI disk controller driver
.El
.Ss Serial and parallel interfaces
.Bl -tag -width 12n -offset indent -compact
.It Xr lpt 4
Generic printer device driver
.It Xr sio 4
Generic serial controller driver
.El
.Ss Hardware Sensors & Watchdog Timers
.Bl -tag -width 12n -offset indent -compact
.It Xr amdsbwd 4
AMD SB600/SB7xx/SB8xx watchdog timer
.It Xr ichwd 4
Intel ICH watchdog timer
.It Xr it 4
ITE IT8705F/IT8712F/IT8716F/IT8718F/IT8726F and SiS SiS950
temperature, voltage, and fan sensor with watchdog timer
.It Xr lm 4
National Semiconductor LM78/79/81 temperature, voltage, and fan sensor
.It Xr wbsio 4
Winbond LPC Super I/O
.El
.Ss Miscellaneous devices
.Bl -tag -width 12n -offset indent -compact
.It Xr atkbdc 4
AT keyboard controller interface
.It Xr joy 4
Joystick device driver
.It Xr ppc 4
Parallel Port Chipset driver
.It Xr syscons 4
System Console driver
.It Xr vga 4
VGA graphics driver
.El
.Sh SEE ALSO
.Xr intro 4
